package main

import "backend/internal/app"

func main() {
	app.Run()
}

/*TODO:
альбомы, сделать создание, удаление, редактирование, добавление треков
добавление треков в плейлисты
создание плейлиста любимые треки при регистрации аккаунта
создание папки для плейлистов
что то сделать с жанрами
автоинкремент на прослушивания
разобраться с ролями
лайк на трек
попросить гпт добавить кнопку мута песни
и добавить кнопки следующего/предыдущего трека
функция которая отправляет запрос гет на получение рандомного трека, которого нет в дизлайках у пользователя
с джоином на альбом чтобы подгружать обложку
*/
